// Плюсы: Относительная простота засчет возможности создания тестов для отдельных частей программы
// Информативность. Грамотно сформированный тест позволяет разобраться в API, функционале модуля и особенностях его использования
// Параллельность. Модульное тестирование даёт возможность проверки одного фрагмента кода независимо от других
// Минусы: Невозможность найти все ошибки - нельзя автоматически предугадать поведение программы для всех возможных исходов
// Из за модульности тестов могут быть незамечены ошибки, всплывающие при интеграции части кода с остальным проектом
